<?php
// Heading
$_['heading_title']                         = 'Playful Sparkle - Live Search';
$_['heading_contact']                       = 'Контакт с поддръжката';

// Text
$_['text_extension']                        = 'Разширения';
$_['text_success']                          = 'Успех: Променихте модула Live Search!';
$_['text_filter_success']                   = 'Успех: Неизползваните филтри бяха премахнати успешно!';
$_['text_edit']                             = 'Редактиране на модул Live Search';
$_['text_contact']                          = '<p>За допълнително съдействие, моля, свържете се с нашия екип за поддръжка:</p><ul><li><strong>Уебсайт за поддръжка:</strong> <a href="%1$s">%1$s</a></li><li><strong>GitHub хранилище:</strong> <a href="%2$s" target="_blank" rel="noopener noreferrer">%2$s</a></li><li><strong>Контакт с поддръжката:</strong> <a href="mailto:%3$s">%3$s</a></li></ul>';

// Tab
$_['tab_general']                           = 'Общи';
$_['tab_products']                          = 'Продукти';
$_['tab_categories']                        = 'Категории';
$_['tab_manufacturers']                     = 'Производители';
$_['tab_informations']                      = 'Информация';
$_['tab_help_and_support']                  = 'Помощ и поддръжка';

// Entry
$_['entry_status']                          = 'Статус';
$_['entry_input_delay']                     = 'Забавяне на въвеждането';
$_['entry_product_status']                  = 'Показване на продукти';
$_['entry_category_status']                 = 'Показване на категории';
$_['entry_category_image']                  = 'Показване на изображение на категория';
$_['entry_category_image_size']             = 'Размер на изображението на категория (Ш x В)';
$_['entry_manufacturer_status']              = 'Показване на производители';
$_['entry_manufacturer_image']              = 'Показване на изображение на производител';
$_['entry_manufacturer_image_size']         = 'Размер на изображението на производител (Ш x В)';
$_['entry_information_status']              = 'Показване на информация';
$_['entry_product_description']             = 'Показване на описание на продукта';
$_['entry_product_description_length']      = 'Дължина на описанието на продукта';
$_['entry_product_image']                   = 'Показване на изображение на продукта';
$_['entry_product_image_size']              = 'Размер на изображението на продукта (Ш x В)';
$_['entry_product_price']                   = 'Показване на цена на продукта';
$_['entry_width']                           = 'Ширина';
$_['entry_height']                          = 'Височина';
$_['entry_input_min_chars']                 = 'Мин. символи';

// Help
$_['help_input_delay']                      = 'Тази настройка определя времето за забавяне (в милисекунди) между момента, в който потребителят натисне клавиш, и момента, в който данните се изпращат към сървъра. Увеличаването на това забавяне може да помогне за намаляване на броя на заявките, изпратени при бързо въвеждане, подобрявайки производителността и времето за реакция на сървъра.';
$_['help_product_description_length']       = 'Укажете максималния брой символи за описанието на продукта. Тази настройка определя колко символа ще се показват в резултатите от търсенето на живо.';
$_['help_input_min_chars']                  = 'Укажете минималния брой символи, необходими преди заявката за търсене да бъде изпратена до сървъра.';

// Error
$_['error_permission']                      = 'Внимание: Нямате разрешение за промяна на модула Live Search!';
$_['error_form']                            = 'Формата съдържа грешки. Моля, коригирайте маркираните полета.';
$_['error_input_delay_min']                 = 'Забавянето на въвеждането трябва да бъде поне 100 милисекунди.';
$_['error_product_description_length_min']  = 'Дължината на описанието на продукта не може да бъде по-малка от 0 символа.';
$_['error_product_description_length_max']  = 'Дължината на описанието на продукта не може да надвишава 200 символа.';
$_['error_product_image_width_min']         = 'Ширината на изображението на продукта трябва да бъде поне 16 пиксела.';
$_['error_product_image_width_max']         = 'Ширината на изображението на продукта не трябва да бъде повече от 128 пиксела.';
$_['error_product_image_height_min']        = 'Височината на изображението на продукта трябва да бъде поне 16 пиксела.';
$_['error_product_image_height_max']        = 'Височината на изображението на продукта не трябва да бъде повече от 128 пиксела.';
$_['error_category_image_width_min']        = 'Ширината на изображението на категорията трябва да бъде поне 16 пиксела.';
$_['error_category_image_width_max']        = 'Ширината на изображението на категорията не трябва да бъде повече от 128 пиксела.';
$_['error_category_image_height_min']       = 'Височината на изображението на категорията трябва да бъде поне 16 пиксела.';
$_['error_category_image_height_max']       = 'Височината на изображението на категорията не трябва да бъде повече от 128 пиксела.';
$_['error_manufacturer_image_width_min']    = 'Ширината на изображението на производителя трябва да бъде поне 16 пиксела.';
$_['error_manufacturer_image_width_max']    = 'Ширината на изображението на производителя не трябва да бъде повече от 128 пиксела.';
$_['error_manufacturer_image_height_min']   = 'Височината на изображението на производителя трябва да бъде поне 16 пиксела.';
$_['error_manufacturer_image_height_max']   = 'Височината на изображението на производителя не трябва да бъде повече от 128 пиксела.';
$_['error_input_min_chars']                 = 'Минималната дължина на въвеждане не може да бъде по-малка от 1 символ.';
