<?php
// Heading
$_['heading_title']                        = 'Playful Sparkle - Ζωντανή Αναζήτηση';
$_['heading_contact']                      = 'Επικοινωνία με την Υποστήριξη';

// Text
$_['text_extension']                       = 'Επεκτάσεις';
$_['text_success']                         = 'Επιτυχία: Τροποποιήσατε το module Ζωντανής Αναζήτησης!';
$_['text_filter_success']                  = 'Επιτυχία: Τα αχρησιμοποίητα φίλτρα αφαιρέθηκαν επιτυχώς!';
$_['text_edit']                            = 'Επεξεργασία Module Ζωντανής Αναζήτησης';
$_['text_contact']                         = '<p>Για περαιτέρω βοήθεια, επικοινωνήστε με την ομάδα υποστήριξής μας:</p><ul><li><strong>Επικοινωνία:</strong> <a href="mailto:%s">%s</a></li><li><strong>Τεκμηρίωση:</strong> <a href="%s" target="_blank" rel="noopener noreferrer">Τεκμηρίωση χρήστη</a></li></ul>';

// Tab
$_['tab_general']                          = 'Γενικά';
$_['tab_products']                         = 'Προϊόντα';
$_['tab_categories']                       = 'Κατηγορίες';
$_['tab_manufacturers']                    = 'Κατασκευαστές';
$_['tab_informations']                     = 'Πληροφορίες';
$_['tab_help_and_support']                 = 'Βοήθεια &amp; Υποστήριξη';

// Entry
$_['entry_status']                         = 'Κατάσταση';
$_['entry_input_delay']                    = 'Καθυστέρηση Εισαγωγής';
$_['entry_product_status']                 = 'Εμφάνιση Προϊόντων';
$_['entry_category_status']                = 'Εμφάνιση Κατηγοριών';
$_['entry_category_image']                 = 'Εμφάνιση Εικόνας Κατηγορίας';
$_['entry_category_image_size']            = 'Μέγεθος Εικόνας Κατηγορίας (Π x Υ)';
$_['entry_manufacturer_status']            = 'Εμφάνιση Κατασκευαστών';
$_['entry_manufacturer_image']             = 'Εμφάνιση Εικόνας Κατασκευαστή';
$_['entry_manufacturer_image_size']        = 'Μέγεθος Εικόνας Κατασκευαστή (Π x Υ)';
$_['entry_information_status']             = 'Εμφάνιση Πληροφοριών';
$_['entry_product_description']            = 'Εμφάνιση Περιγραφής Προϊόντος';
$_['entry_product_description_length']     = 'Μήκος Περιγραφής Προϊόντος';
$_['entry_product_image']                  = 'Εμφάνιση Εικόνας Προϊόντος';
$_['entry_product_image_size']             = 'Μέγεθος Εικόνας Προϊόντος (Π x Υ)';
$_['entry_product_price']                  = 'Εμφάνιση Τιμής Προϊόντος';
$_['entry_width']                          = 'Πλάτος';
$_['entry_height']                         = 'Ύψος';
$_['entry_input_min_chars']                = 'Ελάχιστη εισαγωγή';

// Help
$_['help_input_delay']                     = 'Αυτή η ρύθμιση καθορίζει τον χρόνο καθυστέρησης (σε χιλιοστά του δευτερολέπτου) μεταξύ της στιγμής που ο χρήστης πληκτρολογεί ένα πλήκτρο και της στιγμής που τα δεδομένα αποστέλλονται στον διακομιστή. Η αύξηση αυτής της καθυστέρησης μπορεί να βοηθήσει στη μείωση του αριθμού των αιτημάτων που αποστέλλονται κατά τη διάρκεια γρήγορης εισαγωγής, βελτιώνοντας την απόδοση και τους χρόνους απόκρισης του διακομιστή.';
$_['help_product_description_length']      = 'Καθορίστε τον μέγιστο αριθμό χαρακτήρων για την περιγραφή του προϊόντος. Αυτή η ρύθμιση καθορίζει πόσοι χαρακτήρες θα εμφανίζονται στα αποτελέσματα της ζωντανής αναζήτησης.';
$_['help_input_min_chars']                 = 'Καθορίστε τον ελάχιστο αριθμό χαρακτήρων που απαιτούνται πριν αποσταλεί ένα ερώτημα αναζήτησης στον διακομιστή.';

// Error
$_['error_permission']                     = 'Προειδοποίηση: Δεν έχετε άδεια να τροποποιήσετε το module Ζωντανής Αναζήτησης!';
$_['error_form']                           = 'Η φόρμα περιέχει σφάλματα. Παρακαλώ διορθώστε τα επισημασμένα πεδία.';
$_['error_input_delay_min']                = 'Η καθυστέρηση εισαγωγής πρέπει να είναι τουλάχιστον 100 χιλιοστά του δευτερολέπτου.';
$_['error_product_description_length_min'] = 'Το μήκος της περιγραφής του προϊόντος δεν μπορεί να είναι μικρότερο από 0 χαρακτήρες.';
$_['error_product_description_length_max'] = 'Το μήκος της περιγραφής του προϊόντος δεν μπορεί να υπερβαίνει τους 200 χαρακτήρες.';
$_['error_product_image_width_min']        = 'Το πλάτος της εικόνας του προϊόντος πρέπει να είναι τουλάχιστον 16 pixels.';
$_['error_product_image_width_max']        = 'Το πλάτος της εικόνας του προϊόντος δεν πρέπει να υπερβαίνει τα 128 pixels.';
$_['error_product_image_height_min']       = 'Το ύψος της εικόνας του προϊόντος πρέπει να είναι τουλάχιστον 16 pixels.';
$_['error_product_image_height_max']       = 'Το ύψος της εικόνας του προϊόντος δεν πρέπει να υπερβαίνει τα 128 pixels.';
$_['error_category_image_width_min']       = 'Το πλάτος της εικόνας της κατηγορίας πρέπει να είναι τουλάχιστον 16 pixels.';
$_['error_category_image_width_max']       = 'Το πλάτος της εικόνας της κατηγορίας δεν πρέπει να υπερβαίνει τα 128 pixels.';
$_['error_category_image_height_min']      = 'Το ύψος της εικόνας της κατηγορίας πρέπει να είναι τουλάχιστον 16 pixels.';
$_['error_category_image_height_max']      = 'Το ύψος της εικόνας της κατηγορίας δεν πρέπει να υπερβαίνει τα 128 pixels.';
$_['error_manufacturer_image_width_min']   = 'Το πλάτος της εικόνας του κατασκευαστή πρέπει να είναι τουλάχιστον 16 pixels.';
$_['error_manufacturer_image_width_max']   = 'Το πλάτος της εικόνας του κατασκευαστή δεν πρέπει να υπερβαίνει τα 128 pixels.';
$_['error_manufacturer_image_height_min']  = 'Το ύψος της εικόνας του κατασκευαστή πρέπει να είναι τουλάχιστον 16 pixels.';
$_['error_manufacturer_image_height_max']  = 'Το ύψος της εικόνας του κατασκευαστή δεν πρέπει να υπερβαίνει τα 128 pixels.';
$_['error_input_min_chars']                = 'Το ελάχιστο μήκος εισαγωγής δεν μπορεί να είναι μικρότερο από 1 χαρακτήρα.';
